## Hands-on Lab

### In this Lab we will creat the table below using SQL

![title](https://d3c33hcgiwev3.cloudfront.net/imageAssetProxy.v1/j-hOrU2HEei-Qgpt2td5Qg_6b9f5ac9b0ce3ada08e42d07825e1317_Instructor.jpg?expiry=1577145600000&hmac=vftSiFIC36jngq6yx997S67Yi9yg5uJIsIhkYNj21XY)

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [38]:
%%sql
drop table INSTRUCTOR

 * sqlite://
Done.

[]

Obs: **CHAR()** = sequência de carcteres de tamanho fixo, nesse caso, o tamanho é 2 **CHAR(2)** pois na coluna country so aparece palavras com 2 caracteres (US, CA, UK, etc)
**VARCHAR()** = sequência de caracteres de tamanho variável, o argumento será o tamanho máximo, no caso, não deve existir nenhum país, cidade, etc com um nome com mais de 20 caracteres, então podemos fazer **VARCHAR(20)** para as as variáveis com caracteres variáveis, como firstname, lastname e city

In [39]:
%%sql

create table INSTRUCTOR (
    ins_id int NOT NULL,
    lastname VARCHAR(20) NOT NULL,
    firstname VARCHAR(20)NOT NULL,
    city VARCHAR(20),
    country CHAR(2),    

    PRIMARY KEY(ins_id)
);

 * sqlite://
Done.

[]

In [40]:
%%sql

INSERT INTO INSTRUCTOR
   (ins_id, lastname, firstname, city, country)

   VALUES
   (1, 'Ahuja', 'Rav', 'Toronto', 'CA')
  ;

 * sqlite://
1 rows affected.

[]

In [41]:
%%sql

INSERT INTO INSTRUCTOR
  VALUES
  (2, 'Chong', 'Raul', 'Toronto', 'CA'),
  (3, 'Vasudevan', 'Hima', 'Chicago', 'US')
;

 * sqlite://
2 rows affected.

[]

In [43]:
%%sql

select * from INSTRUCTOR

 * sqlite://
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

### Select people from Canada:

In [47]:
%%sql 

select firstname,lastname from INSTRUCTOR
   where country = 'CA'

 * sqlite://
Done.

[('Rav', 'Ahuja'), ('Raul', 'Chong')]

In [49]:
%%sql

update INSTRUCTOR
set  city = 'Markham'
where ins_id = 1

 * sqlite://
1 rows affected.

[]

In [52]:
%%sql

select * from INSTRUCTOR

 * sqlite://
Done.

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [56]:
%%sql

delete from INSTRUCTOR

WHERE ins_id in ('1','2')

 * sqlite://
2 rows affected.

[]

In [61]:
%%sql

select * from INSTRUCTOR

 * sqlite://
Done.

[(3, 'Vasudevan', 'Hima', 'Chicago', 'US')]